export const QUESTIONS = {
  RU: [
    {
      question: "Что ты делаешь, если что-то не работает на компьютере?",
      options: [
        {
          answer: "Перезагружаю компьютер и надеюсь, что все исправится.",
          isCorrect: false,
        },
        {
          answer: "Ищу решение в интернете или спрашиваю у кого-то, кто знает.",
          isCorrect: true,
        },
      ],
    },
    {
      question:
        "Если бы тебе нужно было выбрать, что бы ты хотел делать: строить роботов или делать веб-сайты?",
      options: [
        { answer: "Я бы построил робота!", isCorrect: false },
        { answer: "Я бы создал крутой веб-сайт!", isCorrect: true },
      ],
    },
    {
      question: "Какой суперспособностью ты бы хотел обладать?",
      options: [
        {
          answer: "Мгновенно решать любые технические проблемы!",
          isCorrect: true,
        },
        {
          answer: "Уметь объяснять сложные вещи простыми словами!",
          isCorrect: false,
        },
      ],
    },
    {
      question:
        "Как бы ты поступил, если твой сайт вдруг сломался на день перед важным мероприятием?",
      options: [
        {
          answer: "Быстро чинил бы все, чтобы он снова заработал!",
          isCorrect: true,
        },
        {
          answer: "Не переживал бы, ведь всегда можно найти решение!",
          isCorrect: false,
        },
      ],
    },
    {
      question: "Если бы ты мог создать любое приложение, что бы это было?",
      options: [
        { answer: "Приложение для помощи людям!", isCorrect: true },
        {
          answer: "Веселое развлекательное приложение для друзей!",
          isCorrect: false,
        },
      ],
    },
  ],
  KG: [
    {
      question: "Эгер компьютерде бир нерсе иштебей калса, эмне кыласың?",
      options: [
        {
          answer:
            "Компьютерди кайра жүктөймүн да, баары жөнгө келет деп үмүттөнөм.",
          isCorrect: false,
        },
        {
          answer: "Интернеттен чечимди издейм же бирөөгө сурайм, ким билет.",
          isCorrect: true,
        },
      ],
    },
    {
      question:
        "Эгер тандоо кылууга туура келсе, эмне кылууну каалар элең: роботторду түзсөңбү же веб-сайттарды түзсөңбү?",
      options: [
        { answer: "Мен роботту курумакмын!", isCorrect: false },
        { answer: "Мен күчтүү веб-сайт түзмөкмүн!", isCorrect: true },
      ],
    },
    {
      question:
        "Эгерде бир суперкубатка ээ болуу мүмкүнчүлүгүң болсо, кандай суперкубатты тандайт элең?",
      options: [
        {
          answer: "Бардык техникалык маселелерди дароо чечүү!",
          isCorrect: true,
        },
        {
          answer: "Күрдүк нерселерди жөнөкөй сөздөр менен түшүндүрүү!",
          isCorrect: false,
        },
      ],
    },
    {
      question:
        "Эгерде сага сайтты маанилүү иш-чарага бир күн калганда бузулуп калса, эмне кылмаксың?",
      options: [
        { answer: "Жылдам оңдоп, сайтты кайра иштетем!", isCorrect: true },
        {
          answer: "Кооптонбойм, анткени ар дайым чечим табууга болот!",
          isCorrect: false,
        },
      ],
    },
    {
      question:
        "Эгерде сен каалагандай бир тиркеме түзүүгө мүмкүнчүлүгүң болсо, эмнени түзмөксүң?",
      options: [
        { answer: "Адамдарга жардам берүүчү тиркеме!", isCorrect: true },
        { answer: "Достор үчүн көңүлдүү тиркеме!", isCorrect: false },
      ],
    },
  ],
};

export const TITLE = {
  RU: "Какой ВЫ программист?",
  KG: "Сиз кандай программистсиз?",
};
